{
    "intents": [
	{
            "tag": "greeting",
            "patterns": ["Hi", "How are you", "Is anyone there?", "Hello", "Good day"],
            "responses": ["Hello, I am her  to solve all your quesries", "Good to see you, what doubt do you have regarding SCTCE?", "Hi there, how can I help?"]
        },        
	{"tag": "goodbye",
         "patterns": ["Bye", "See you later", "Goodbye"],
         "responses": ["See you later, thanks for visiting", "bye"]
        },

        {"tag": "thanks",
         "patterns": ["Thanks", "Thank you", "That's helpful"],
         "responses": ["Happy to help!", "Any time!", "My pleasure"]
        },

        {"tag": "hours",
         "patterns": ["What hours is the college open?", "What are working hours?", "Till what time are the classes?" ],
         "responses": ["We're open every day 9am-5pm, classes are from 9:30-4:30.", "Our hours are 9am-5pm every day, classes are from 9:30-4:30."]
        },

        {"tag": "departments",
         "patterns": ["Which departments does college have?", "What are the departments?", "What all subjects can be majored?" ],
         "responses": ["The college has 6 departments - Computer Science, Electronics and communication, Mechanical Engineering (Automobile, Production) and Biotechnology."]
        },
       {"tag": "facilities",
        "patterns": ["What facilities does college have ?", "What facilites do the students avail?" , "What are the various facilities?"],
        "responses": ["The college has a decent Central Computing Facility, Library, Hostel life, College Bus, Canteen and Online fee payment facilities."]
       },

     {"tag": "contact",
      "patterns": ["How can i contact the college ?", "How can i get in touch with the college?","How can i reach out to the college?","how can i call college"],
      "responses": ["Call the college at 9446567842 or send an email to sctcollege@sctce.in"]
     },

        {"tag": "name",
        "patterns": ["Who are you?", "What is your name?", "What should i call you", "What name do you go by?"],
        "responses": ["Hello,I am SCTCE's virtual assistant and my developers have named me PiDisha"]
        },       
	{
            "tag": "accreditation",
            "patterns": ["Does the college have accreditation?", "Is the college accredited?", "Does the college fall in the categories of accredited colleges?"],
            "responses": ["Yes, the college is accredited by National Board Of Accreditation. The branches Computer Science, Electronics and Communication , Mechanical and Automobile are accredited."]
        },
        {
            "tag": "rank_india",
            "patterns": ["What is the rank of the college in India?"],
            "responses": ["The college is ranked 65th in the list of top 100 engineering colleges in India."]
        },
        {
            "tag": "rank_kerala",
            "patterns": ["What is the rank of the college in Kerala?"],
            "responses": ["The college is one of the top 10 Engineering colleges in Kerala."]
        },
        {
            "tag": "rank_tvm",
            "patterns": ["What is the rank of college in Trivandrum?"],
            "responses": ["It is one of the top 5 Engineering colleges in Trivandrum"]
        },
        {
            "tag": "better",
            "patterns": ["Is SCT better than CET?"],
            "responses": ["No doubt :P"]
        },
        {
            "tag": "cultural",
            "patterns": ["Does the college have any cultual fests?"],
            "responses": ["Yes. The following site will give you all the information regarding the fest."]
        },
        {
            "tag": "fest",
            "patterns": ["how many fests does the college have?"],
            "responses": ["The college has an annual technical and cultural fest of SCT titled Cult A Way."]
        },
        {
            "tag": "cultaway",
            "patterns": ["What is cult a way?", "Is there any technical fest the college hosts?", "what is caw?", "What is CAW?", "Is caw the cultural fest of sct?"],
            "responses":[ "Cult a Way is the annual technical and cultural festival of SCT. It is a four- or five-day event and almost all colleges in the state participate. The events includes technical workshops and cultural events like dance programs, treasure hunt, quizzes, fashion shows, etc."]
        },
        {
            "tag": "years",
            "patterns": ["How many years old is CAW?"],
            "responses": ["CAW started in 2011 and became one of the major college fests in Kerala."]
        },
        {
            "tag": "old_college",
            "patterns": ["How many years old is the college?", "When did the college start functioning?","How old is SCT?"],
            "responses": ["The college was established under the University of Kerala in 1995, with AICTE approval and is 24 years old."]
        },
        {
            "tag": "qualification",
            "patterns": ["What is the minimum qualifiction of the staff at SCT?"],
            "responses": ["Post graduation is the minimum qualification for the teaching staff. for futher details on qualifications contact the administrative office."]
        },
        {
            "tag": "join",
            "patterns": ["Why should I join SCT?"],
            "responses": ["It is one of the top 5 Engineering colleges in Trivandrum and the placement opportunities provided are good."]
        },
        {
            "tag": "cocurricular",
            "patterns": ["What are the co curricular activities at the college?"],
            "responses": ["There are various functions and activities conducted by different branches that let students explore their talents in various arena and perform."]
        },
        {
            "tag": "sport_facilities",
            "patterns": ["What facilities are provided for sports?"],
            "responses": ["Every year teams are formed for Basketball, Volleyball, Badminton, Cricket and Football. Students have Sports day to showcase their sporty spirit and also are allowed to participate in intercollege sport competitions representing colleges."]
        },
        {
            "tag": "advance_sports",
            "patterns": ["How advance are the sports facilities?"],
            "responses": ["This information can be provided to you by the staff at college or by contacting the Sports Secretary who is elected annually to take care of the needs of students in with respect to sports."]
        },
        {
            "tag": "promote_activities",
            "patterns": ["Does the college promote extra curricular activities?"],
            "responses": ["Yes, the college encourages participation in intercollege events as well as conducts intracollege competition to help students explore their skills."]
        },
        {
            "tag": "college_activities",
            "patterns": ["What are the extra curricular activities the college provides?"],
            "responses": ["There are various functions and activities conducted by different branches that let students explore their talents in various arena and perform."]
        },
        {
            "tag": "societies",
            "patterns": ["Does the college have any socities?", "What are the different socities in the college?"],
            "responses": ["Yes. The college has a lot of clubs.There are debate clubs, fine arts club, film club, photography club etc"]
        },
        {
            "tag": "uniform",
            "patterns": ["Do the students have to wear unifroms to college?", "What is the uniform?"],
            "responses": ["No, the college does not have uniforms. Students are allowed to wear casuals to college and as per the rules shorts/miniskirts/skirts/sleeveless etc are not allowed."]
        },
        {
            "tag": "dress_code",
            "patterns": ["Is there any dress code to be followed?"],
            "responses": ["As per the dress code allowed students can wear casuals to college but shorts/miniskirts/skirts/sleeveless or anything above knee length etc are not allowed."]
        },
        {
            "tag": "girls_wear",
            "patterns": ["Can girls wear skirts to college?"],
            "responses": ["No, girls are not allowed to wear skirts to college unless and until there is a genuine reason(example: injury) for which prior permission must be granted from their respective departments."]
        },
        {
            "tag": "boys_wear",
            "patterns": ["Can boys wear mundu to college?"],
            "responses": ["Yes, boys are allowed to wear mundu to college."]
        },
        {
            "tag": "sleeveless",
            "patterns": ["Can girls wear sleeveless dresses to college?"],
            "responses": ["No, girls are not allowed to wear sleeveless. Proper and modest dressing is a must to college."]
        },
        {
            "tag": "dress_mtech",
            "patterns": ["What is the dress code to be followed by Mtech students?"],
            "responses": ["The dress code is same for the entire institute. As per the dress code allowed students can wear casuals to college but shorts/miniskirts/skirts/sleeveless or anything above knee length etc are not allowed."]
        },
        {
            "tag": "campus_size",
            "patterns": ["How big is the campus?", "What is the size of campus?"],
            "responses": ["Take a walk around it and decide for yourself :P"]
        },
        {
            "tag": "gym",
            "patterns": ["Is there a gym at college?"],
            "responses": ["There is no gym facility provided by the institute itself but there are such services near to college."]
        },
        {
            "tag": "swimming_pool",
            "patterns": ["Is there a swimming pool on the campus?"],
            "responses": ["No, there is no swimming pool within the campus."]
        },
        {
            "tag": "hostel_gym",
            "patterns": ["Does the boys hostel have a gym?"],
            "responses": ["No, there is no gym for boys at hostels."]
        },
        {
            "tag": "gym_girls",
            "patterns": ["Does the girls hostel have gym?"],
            "responses": ["No, there is no gym for girls at hostels."]
        },
        {
            "tag": "boys_pool",
            "patterns": ["Does the boys hostel have a pool?"],
            "responses": ["No, there is no swimming pool for boys at hostels."]
        },
        {
            "tag": "hostel_wifi",
            "patterns": ["Does the boys hostel have wifi facilites?"],
            "responses": ["Yes, there are hostels that provide wifi services. For further information regarding that please contact the hostel owners."]
        },
        {
            "tag": "pool_girls",
            "patterns": ["Does the girls hostel have a pool?"],
            "responses": ["No, there is no swimming pool for girls at hostels."]
        },
        {
            "tag": "hostel_wifi",
            "patterns": ["does the girls hostel have wifi facilities?"],
            "responses": ["Yes, there are hostels that provide wifi services. For further information regarding that please contact the hostel owners."]
        },
        {
            "tag": "campus_wifi",
            "patterns": ["Are there facilities of wifi on the campus?", "Does the campus have wifi facilities?", "Is the campus wifi connected?"],
            "responses": ["The Central Computing Facility has a wifi service that students can use in times of need."]
        },
        {
            "tag": "far_girls",
            "patterns": ["How far is the girls hostel from the campus?"],
            "responses": ["There are various girls hostels around the college which are at walkable distances."]
        },
        {
            "tag": "far_boys",
            "patterns": ["How far is the boys hostel from the campus?"],
            "responses": ["There are various boys hostels around the college which are at walkable distances."]
        },
        {
            "tag": "hostel_campus",
            "patterns": ["Are the hostels within the campus?", "Does the campus have hostel facilities?"],
            "responses": ["No, there are no hostels within the college campus and none provided by college."]
        },
        {
            "tag": "Ashiyana_distance",
            "patterns": ["How far is Ashiyana from college?"],
            "responses": ["M/S Ashiyana Hostel at Karakkamandapam is 1 KM from College."]
        },
        {
            "tag": "college_hostel",
            "patterns": ["Why does the college not provide hostel facilities?"],
            "responses": ["M/S Ashiyana Hostel at Karakkamandapam was selected as the college hostel for girl students since 2011 and 60 students can be accommodated in the hostel."]
        },
        {
            "tag": "day_scholars",
            "patterns": ["Does the college only have day scholars?", "Are there more day scholars in SCT?"],
            "responses": ["The college has both day scholars as well as hostelers."]
        },
        {
            "tag": "food",
            "patterns": ["Can we eat food on campus?", "Is there food serving services available in campus?", "Is there a cafeteria on campus?"],
            "responses": ["The college has a canteen service within campus from where students can have their breakfast and lunch."]
        },
        {
            "tag": "menu",
            "patterns": ["What is the menu of the canteen?"],
            "responses": ["You can check with the canteen staff for any special dishes made today. On a regular basis meals are available for lunch."]
        },
        {
            "tag": "cafeteria_menu",
            "patterns": ["What is the menu of the cafeteria?","what is the menu of mini cafeteria?"],
            "responses": ["Authentic Malayali snacks are available at the cafeteria along with cold drinks and beverages."]
        },
        {
            "tag": "mini_canteen",
            "patterns": ["what is a mini canteen?"],
            "responses": ["A service provided for students and faculty members to have tea and snacks during lunch break or even after class."]
        },
        {
            "tag": "undergraduate_semester",
            "patterns": ["How many semesters do the under graduate students have every year?"],
            "responses": ["There are 2 semesters every year for the undergraduate students."]
        },
        {
            "tag": "vacation",
            "patterns": ["When do the students get vacation?"],
            "responses": ["The students get a vaction after every year in June-July apart from all other leaves."]
        },
        {
            "tag": "odd_semester",
            "patterns": ["When does a semester start?"],
            "responses": ["The odd semester usually starts in August and even semester starts by January once the previous semester exams are finished."]
        },
        {
            "tag": "odd_semester",
            "patterns": ["When is the odd sem?", "When is the odd semester?"],
            "responses": ["The odd semester usually lasts from August to December. Further details will be provided in the academic calendar released by the University."]
        },
        {
            "tag": "even_semester",
            "patterns": ["When is the even sem?", "When is the even semester?"],
            "responses": ["The even semester usually lasts from January to May. Further details will be provided in the academic calendar released by the University."]
        },
        {
            "tag": "exam",
            "patterns": ["When do the exams start?"],
            "responses": ["The last month of every semester exams for that particular semester will be scheduled."]
        },
        {
            "tag": "leave_between",
            "patterns": ["Are there leaves between even and odd sem?", "Are there leaves between even and odd semester?"],
            "responses": ["There are a few days leave given after odd sem before the even sem starts."]
        },
        {
            "tag": "exams_yearly",
            "patterns": ["How many exams are there every year?"],
            "responses": ["There are 2 exams every year for the 2 semesters covered in 1 year."]
        },
        {
            "tag": "academic_begin",
            "patterns": ["When does the academic year begin?"],
            "responses": ["An academic year begins when the odd semester starts, details of which will be provided in the academic calendar published by the University."]
        },
        {
            "tag": "year_end",
            "patterns": ["When does the academic year end?"],
            "responses": ["An academic year ends when the even semester ends, details of which will be provided in the academic calendar published by the University."]
        },
        {
            "tag": "semester_mtech",
            "patterns": ["How many semesters do the Mtech students have every year?"],
            "responses": ["2"]
        },
        {
            "tag": "semester_btech",
            "patterns": ["how many semesters do the Btech students have?"],
            "responses": ["There are 8 semesters in 4 years to be successfully completed by a student to qualify BTech"]
        },
        {
            "tag": "why_phones",
            "patterns": ["Why are mobile phones not allowed on campus?"],
            "responses": ["As per the order from High Court, mobile phones are not to be used within college campus and SCTCE strictly abides by the law."]
        },
        {
            "tag": "mobile_phones",
            "patterns": ["Are mobile phones allowed on campus?","Can mobile phones be brought to college?", "Can mobile phones be used on campus?"],
            "responses": ["Mobile phones are not allowed in the campus. It can be brought but students are not allowed to use them within campus."]
        },
        {
            "tag": "pay_phone",
            "patterns": ["Does the college provide a pay phone to make calls?", "Does the college provide a pay phone to make calls since mobile phones are not allowed?"],
            "responses": ["No, the college does not provide any such provision as of now but any urgent cases will be handled by the respective department staff."]
        },
        {
            "tag": "emergency_call",
            "patterns": ["What are the facilities provided for the student to make emergency calls?"],
            "responses": ["The college does not provide any facilities for that as of now but any urgent and genuine cases will be handled by the respective department staff."]
        },
        {
            "tag": "attendance",
            "patterns": ["Is there compulsory attendance?", "Is 75% attendance on overall basis enough to pass?","What happens to a student who doesn’t have 75% overall attendance?", "What happens if we don’t have 75% attendance?"],
            "responses": ["https://ktu.edu.in/data/AcademicsFaq.pdf?=5vun92J9sX3I1zXDOQtB2G38dRLHFxQZRJb0um6OMiw%3D"]
        },
        {
            "tag": "duty_leave",
            "patterns": ["Does the college provide duty leave?", "How can one apply for duty leave?"],
            "responses": ["Yes. Go to your staff advisor for guidance."]
        },
        {
            "tag": "criteria_duty",
            "patterns": ["What is the criteria of getting duty leave?"],
            "responses": ["Genuine reasons such as volunteering for any of the events approved by the college."]
        },
        {
            "tag": "ktu_duty",
            "patterns": ["What is duty leave?", "Does KTU provide duty leave?"],
            "responses": ["https://www.google.co.in/search?q=duty+leave+for+ktu&rlz=1C1GCEU_enIN848IN848&oq=duty+leave+&aqs=chrome.1.69i57j0l5.5503j1j7&sourceid=chrome&ie=UTF-8"]
        },
        {
            "tag": "minimum_attendance",
            "patterns": ["Why is there a minimum attendance required?","What is the minimum attendance required?", "What is the minimum attendance required per subject?","Is there a minimum attendance for each subject?","What are the consequences of not having the minimum attendance?", "What happens to a student who doesn’t have minimum attendance?"],
            "responses": ["https://ktu.edu.in/data/AcademicsFaq.pdf?=5vun92J9sX3I1zXDOQtB2G38dRLHFxQZRJb0um6OMiw%3DD"]
        },
        {
            "tag": "rule_attendance",
            "patterns": ["What are the rules regarding attendance?", "What is the attendance criteria to write end sem exams for mtech students?", "What is the attendance criteria to write end sem exams for btech students?", "What are the attendance rules?"],
            "responses": ["https://ktu.edu.in/data/AcademicsFaq.pdf?=5vun92J9sX3I1zXDOQtB2G38dRLHFxQZRJb0um6OMiw%3D"]
        },
        {
            "tag": "incharge_attendance",
            "patterns": ["Who is incharge of attendence?", "Who is in charge of the attendance wing?"],
            "responses": ["The attendance wing of the college deals with the attendance. A teaching staff is appointed as the head of the attendance wing which is subject to change every year."]
        },
        {
            "tag": "attendance_wing",
            "patterns": ["Where is the attendance wing?"],
            "responses": ["First floor- administrative office of the college."]
        },
        {
            "tag": "time_attendance",
            "patterns": ["Till what time does do we get attendance?"],
            "responses": ["Before ayappan chettan takes away the attendance slip :P"]
        },
        {
            "tag": "know_attendance",
            "patterns": ["How can we know what our attendance is?", "How can a student know what his/her attendance is?"],
            "responses": ["Attendance is regularly updated here - http://www.campusoftonline.com/atten/login.php?type=Student%20Login"]
        },
        {
            "tag": "update_attendance",
            "patterns": ["How frequently does the attendance site get updated?"],
            "responses": ["It depends on various factors such as number of working days, how lazy the staff is etc :P"]
        },
        {
            "tag": "attendance_site",
            "patterns": ["Who updates the attendance site?"],
            "responses": ["The staff present at the attendance wing"]
        },
        {
            "tag": "site_construction",
            "patterns": ["Why is the attendance site not opening?"],
            "responses": ["Contact the attendance wing. The site might be under construction."]
        },
        {
            "tag": "site_problem",
            "patterns": ["Why is the attendance site under construction?", "When will the attendance site be ready?", "My attendance has not been updated, what shall I do?"],
            "responses": ["Contact the attendance wing."]
        },
        {
            "tag": "site_update",
            "patterns": ["When will the attendance wing update the site?"],
            "responses": ["Let's hope soon. XD"]
        },
        {
            "tag": "cuts_attendance",
            "patterns": ["What can be done if the teacher cuts attendance for no reason?"],
            "responses": ["Behave well next time."]
        },
        {
            "tag": "complain_teacher",
            "patterns": ["Where can we complain against any teacher?"],
            "responses": ["Feedback form :P If you are facing any serious issues please go to your HOD or the principal."]
        },
        {
            "tag": "complaint",
            "patterns": ["Where can we register any complaint?"],
            "responses": ["If you are facing any serious issues please go to your HOD or the principal."]
        },
        {
            "tag": "ragging",
            "patterns": ["What are the rules to stop ragging?", "What are the rules to prevent ragging?", "What are the actions taken against students who rag other students?", "Where can one complaint against ragging?", "I am being bullyed.", "I am being ragged."],
            "responses": ["https://www.sctce.ac.in/anti-ragging/"]
        },
        {
            "tag": "bullying",
            "patterns": ["Is there bullying on campus?"],
            "responses": ["There are strict anti ragging rules in the campus. We ensure no child is bullied."]
        },
        {
            "tag": "ragging_campus",
            "patterns": ["Is there ragging on campus?"],
            "responses": ["There are strict anti ragging rules in the campus. We ensure no child is bullied."]
        },
        {
            "tag": "ragging_complaint",
            "patterns": ["I want to complain against ragging."],
            "responses": ["Please go complain with the concerned authorities."]
        },
        {
            "tag": "abuse_complaint",
            "patterns": ["What are the rules to prevent sexual abuse?"],
            "responses": ["Please complain by clicking here."]
        },
        {
            "tag": "abuse_complaint",
            "patterns": ["where to compain against sexual abuse?"],
            "responses": ["Please complain by clicking here."]
        },
        {
            "tag": "abuse_complaint",
            "patterns": ["I am being sexually abused."],
            "responses": ["Please complain by clicking here."]
        },
        {
            "tag": "political_parties",
            "patterns": ["Why are there different political parties on campus?"],
            "responses": ["The introduction of college council groups has led not only to a healthy student voice but it has also become a tool for shaping young people's mind for voting in the future. Thus politics culture is promoted on campus."]
        },
        {
            "tag": "role_parties",
            "patterns": ["What is the role of political parties on campus?"],
            "responses": ["Students from political and non politcal background are elected to the students council/union."]
        },
        {
            "tag": "need_party",
            "patterns": ["Why does an engineering college need to have political party?"],
            "responses": ["The introduction of college council groups has led not only to a healthy student voice but it has also become a tool for shaping young people's mind for voting in the future. Thus politics culture is promoted on campus."]
        },
        {
            "tag": "party_campus",
            "patterns": ["How many different political parties are there on campus?", "How many different political parties are there in collge?"],
            "responses": ["So far there are three - ABVP, KSU, SFI"]
        },
        {
            "tag": "election_hold",
            "patterns": ["What kind of elections does the college hold?"],
            "responses": ["Democracy is followed."]
        },
        {
            "tag": "democratic_election",
            "patterns": ["Are the elections connducted democratically?", "Is there democratic rule?"],
            "responses": ["YES."]
        },
        {
            "tag": "malayalam",
            "patterns": ["Does the chat bot support malayalam?"],
            "responses": ["Not yet. I'm learning."]
        },
        {
            "tag": "language_chatbot",
            "patterns": ["How many languages does the chatbot know?"],
            "responses": ["Just one but I'm learning more."]
        },
        {
            "tag": "elective_college",
            "patterns": ["What are the electives the college provide?"],
            "responses": ["It varies across branches and semesters."]
        },
        {
            "tag": "management_elective",
            "patterns": ["Are there any management related electives?"],
            "responses": ["Yes.Economics and principles of management are some examples."]
        },
        {
            "tag": "finance_elective",
            "patterns": ["Are there any finance related electives?"],
            "responses": ["Economics is an elective."]
        },
        {
            "tag": "college_university",
            "patterns": ["does the college belong to KU or KTU?"],
            "responses": ["Currently under KTU."]
        },
        {
            "tag": "ku_ktu",
            "patterns": ["Which is better KU or KTU?"],
            "responses": ["Here are some reviews on Quora."]
        },
        {
            "tag": "select_ku",
            "patterns": ["Can we select KU?"],
            "responses": ["KU no longer exists."]
        },
        {
            "tag": "dual_degree",
            "patterns": ["Does the college have dual degree?", "Does the college provide dual degrees?"],
            "responses": ["No."]
        },
        {
            "tag": "program_year",
            "patterns": ["What all programs does the college have this year?"],
            "responses": ["Look up the academic calendar."]
        },
        {
            "tag": "program_campus",
            "patterns": ["What all programs are conducted on campus?"],
            "responses": ["There are a lot of literary,arts,quizzing etc apart from technical events."]
        },
        {
            "tag": "job",
            "patterns": ["Can I get a job here?", "How can I apply for a job?"],
            "responses": ["Contact the administrative office for finding out the vacancies."]
        },
        {
            "tag": "prepare_placement",
            "patterns": ["How well does the college prepare one for placements?"],
            "responses": ["The students are given training on soft skills as well as technical skills from their first semester itself."]
        },
        {
            "tag": "placed",
            "patterns": ["How can I get placed?"],
            "responses": ["Get yourself enrolled in the CGPU in your final year and work on your technical and soft skills. The rest is fate :)"]
        },
        {
            "tag": "placement_details",
            "patterns": ["Can we get the placement details of previous years?"],
            "responses": ["https://www.sctce.ac.in/placement-cell/"]
        },
        {
            "tag": "everyone_placed",
            "patterns": ["Does everyone get placed?"],
            "responses": ["Here are some placement statistics."]
        },
        {
            "tag": "placements_conduct",
            "patterns": ["How are placements conducted?"],
            "responses": ["Contact the CGPU"]
        },
        {
            "tag": "incharge_placements",
            "patterns": ["Who is in charge of placements?", "How can one apply for placements?"],
            "responses": ["https://www.sctce.ac.in/placement-cell/"]
        },
        {
            "tag": "is_placements",
            "patterns": ["Is there placements?"],
            "responses": ["Yes, placements are carried out every year "]
        },
        {
            "tag": "companies_placement",
            "patterns": ["How many companies come for placements?", "Which all companies provide recruitment?"],
            "responses": ["Contact the CGPU"]
        },
        {
            "tag": "IT_companies",
            "patterns": ["Why are there more IT companies coming for placements?"],
            "responses": ["IT industry is one of the biggest industry in India."]
        },
        {
            "tag": "cs_placed",
            "patterns": ["Do only CS students get placed?"],
            "responses": ["Placements are provided to all the students across all the branches."]
        },
        {
            "tag": "placement_package",
            "patterns": ["What are the placement packages?"],
            "responses": ["Varies across companies"]
        },
        {
            "tag": "minimum_package",
            "patterns": ["What is the minimum package?"],
            "responses": ["This is subject to change."]
        },
        {
            "tag": "highest_package",
            "patterns": ["What is the highest package?"],
            "responses": ["This is subject to change."]
        },
        {
            "tag": "minimum_rank",
            "patterns": ["What is the minimum rank to get admission at SCT?"],
            "responses": ["Here are some cut offs of some previous years."]
        },
        {
            "tag": "minimum_cs",
            "patterns": ["What is the minimum rank to get admission in CS department?"],
            "responses": ["Here are some cut offs of some previous years."]
        },
        {
            "tag": "minimum_ec",
            "patterns": ["What is the minimum rank to get admission in EC department?"],
            "responses": ["Here are some cut offs of some previous years."]
        },
        {
            "tag": "minimum_mech",
            "patterns": ["What is the minimum rank to get admission in Mech department?"],
            "responses": ["Here are some cut offs of some previous years."]
        },
        {
            "tag": "minimum_mechanical",
            "patterns": ["What is the minimum marks to get admission in mechanical department?"],
            "responses": ["Here are some cut offs of some previous years."]
        },
        {
            "tag": "minimum_computer",
            "patterns": ["What is the minimum rank to get admission in Computer Science department?"],
            "responses": ["Here are some cut offs of some previous years."]
        },
        {
            "tag": "minimum_electronics",
            "patterns": ["What is the minimum rank to get admission in Electronics department?"],
            "responses": ["Here are some cut offs of some previous years."]
        },
        {
            "tag": "minimum_production",
            "patterns": ["What is the minimum rank to get admission in Production department?"],
            "responses": ["Here are some cut offs of some previous years."]
        },
        {
            "tag": "admission_criteria",
            "patterns": ["What is the admission criteria to get admissions in SCT?"],
            "responses": ["https://www.sctce.ac.in/admission/"]
        },
        {
            "tag": "admission_marks",
            "patterns": ["What is the minimum marks required to get admission in SCT?"],
            "responses": ["Here are some cut offs of some previous years."]
        },
        {
            "tag": "score_entrance",
            "patterns": ["What is the minimum score required in entrance exam to get admission?"],
            "responses": ["Here are some cut offs of some previous years."]
        },
        {
            "tag": "entrance_cs",
            "patterns": ["What is the minimum score required in entrance exam to get admission in CS department?"],
            "responses": ["Here are some cut offs of some previous years."]
        },
        {
            "tag": "entrance_computer",
            "patterns": ["What is the minimum score required in entrance exam to get admission in Computer Science department?"],
            "responses": ["Here are some cut offs of some previous years."]
        },
        {
            "tag": "entrance_ec",
            "patterns": ["What is the minimum score required in entrance exam to get admission in EC department?"],
            "responses": ["Here are some cut offs of some previous years."]
        },
        {
            "tag": "entrance_electronics",
            "patterns": ["What is the minimum score required in entrance exam to get admission in Electronics department?"],
            "responses": ["Here are some cut offs of some previous years."]
        },
        {
            "tag": "entrance_mech",
            "patterns": ["What is the minimum score required in entrance exam to get admission in Mech department?"],
            "responses": ["Here are some cut offs of some previous years."]
        },
        {
            "tag": "entrance_mechanical",
            "patterns": ["What is the minimum score required in entrance exam to get admission in Mechanical department?"],
            "responses": ["Here are some cut offs of some previous years."]
        },
        {
            "tag": "entrance_production",
            "patterns": ["What is the minimum score required in entrance exam to get admission in Production department?"],
            "responses": ["Here are some cut offs of some previous years."]
        },
        {
            "tag": "entrance_automobile",
            "patterns": ["What is the minimum score required in entrance exam to get admission in Automobile department?"],
            "responses": ["Here are some cut offs of some previous years."]
        },
        {
            "tag": "without_entrance",
            "patterns": ["Is there any way to get admission without clearing the entrance test?"],
            "responses": ["One can get admission in the management quota or the NRI quota"]
        },
        {
            "tag": "principal",
            "patterns": ["Who is the principal?"],
            "responses": ["https://www.sctce.ac.in/principal/"]
        },
        {
            "tag": "admission_ways",
            "patterns": ["What all are the ways in which admission can be sought?"],
            "responses": ["Government quota, NRI quota, Management quota, KSRTC quota are the categories in which admission can be sought."]
        },
        {
            "tag": "NRI_admission",
            "patterns": ["Can NRIs get admission?"],
            "responses": ["Yes."]
        },
        {
            "tag": "Kerala_admission",
            "patterns": ["Can non Kerala students get admission?"],
            "responses": ["Yes."]
        },
        {
            "tag": "admission_second",
            "patterns": ["Can admission be got in second year?"],
            "responses": ["Yes."]
        },
        {
            "tag": "college_transfer",
            "patterns": ["Is college transfer possible?"],
            "responses": ["https://ktu.edu.in/data/AcademicsFaq.pdf?=5vun92J9sX3I1zXDOQtB2G38dRLHFxQZRJb0um6OMiw%3D"]
        },
        {
            "tag": "transfer_department",
            "patterns": ["Is transfer from one department to another possible?"],
            "responses": ["Yes. It is based on marks."]
        },
        {
            "tag": "fee_structure",
            "patterns": ["How is the fee structure in college?"],
            "responses": ["https://www.sctce.ac.in/admission/"]
        },
        {
            "tag": "fee_payment",
            "patterns": ["How is fee payment carried out in college?"],
            "responses": ["It can be done online as well as offline."]
        },
        {
            "tag": "teacher_interactions",
            "patterns": ["Are there student teacher interactions outside the classroom?"],
            "responses": ["PTA meetings are conducted on regular basis to evaluate student performance."]
        },
        {
            "tag": "mentoring_students",
            "patterns": ["Are there mentoring sessions for students?"],
            "responses": ["Yes. A lot of them are carried over an academic year."]
        },
        {
            "tag": "teacher_student",
            "patterns": ["Do teachers help students who are weak in academics?", "Do the teachers interact with students about their personal problems?", "Do the teachers help students with their academics?"],
            "responses": ["Yes. The teaching staff is very friendly and helping."]
        }
    ]
}
